/**
 * Created by wangyingchao on 16/5/7.
 */

$(function () {

    headPopup();  //header
    nav_1Popup();  //nav_1
    nav_2Popup(); //article1 nav_2

    //header
    function headPopup(){
        fnPopup('city'); //城市弹窗
        fnCity('city'); //城市选择

        fnPopup('myJd');//我的京东弹窗
        fnPopup('phoneJd');//手机京东弹窗
        fnPopup('followJd');//关注京东弹窗
        fnPopup('server');//客户服务弹窗
        fnPopup('webNav');//网站导航弹窗
    }

    //nav_1
    function nav_1Popup(){
        fnPopup('shop');//购物车弹窗
    }

    //article1 nav_2
    function nav_2Popup (){
        $('.type_list').delegate('li','mouseover', function () {
            $(this).addClass('active');
            $(this).siblings().removeClass('active');
            $('.popup_nav_2').show();

            removePopupData();
            createPopupData($(this).index());

        });
        $('#nav_2').on('mouseleave', function () {
            $(this).find('.active').removeClass('active');
            $('.popup_nav_2').hide();
        });
    }
});

//城市选择
function fnCity(id){
    var $popup = $('.popup_'+id);
    var $Li = $popup.find('li');
    var $Span = $('.content_'+id).find('span');

    $Li.each(function () {
        $(this).on('click',function (){
            $Span.html($(this).html());
            $(this).siblings().attr('class', '');
            $(this).attr('class','active_1');
            $popup.hide();
        });

        $(this).hover(function () {
            if($(this).attr('class') != 'active_1'){
                $(this).attr('class','active_2')
            }
        }, function () {
            if($(this).attr('class') != 'active_1'){
                $(this).attr('class','')
            }
        });
    })
}

//弹窗
function fnPopup(id){

    var $wrap = $('.wrap_'+id);
    var $content = $('.content_'+id);
    var $popup = $('.popup_'+id);
    $wrap.hover(function () {
        $popup.show();
        $content.addClass('active');
        $wrap.find('.arrow').css('transform','rotate(180deg)');
    }, function () {
        $popup.hide();
        $content.removeClass('active');
        $wrap.find('.arrow').css('transform','rotate(0deg)');
    })
}

//创建nav_2的弹窗
function createPopupData(index){
    var arr1= [
        {
            "title":['品牌日','家电城','智能生活馆','京东净化馆','京东帮服务店','值得买精选'],
            "img_a":['img/adlogo/2_a_1.gif','img/adlogo/2_a_2.gif','img/adlogo/2_a_3.gif','img/adlogo/2_a_4.gif','img/adlogo/2_a_5.gif','img/adlogo/2_a_6.gif','img/adlogo/2_a_7.gif','img/adlogo/2_a_7.gif'],
            "img_b":['img/adlogo/2_b_1.gif','img/adlogo/2_b_2.gif']
        },
        {
            "title":['金融首页','尖er货','玩bigger','大牌免息','财发现'],
            "img_a":['img/adlogo/3_a_1.gif','img/adlogo/3_a_2.gif','img/adlogo/3_a_3.gif','img/adlogo/3_a_4.gif','img/adlogo/3_a_5.gif','img/adlogo/3_a_6.gif','img/adlogo/3_a_7.gif','img/adlogo/3_a_7.gif'],
            "img_b":['img/adlogo/3_b_1.gif','img/adlogo/3_b_2.gif']
        },
        {
            "title":['男装','女装','内衣','珠宝','国际品牌','饰品'],
            "img_a":['img/adlogo/1_a_1.gif','img/adlogo/1_a_2.gif','img/adlogo/1_a_3.gif','img/adlogo/1_a_4.gif','img/adlogo/1_a_5.gif','img/adlogo/1_a_6.gif','img/adlogo/1_a_7.gif','img/adlogo/1_a_7.gif'],
            "img_b":['img/adlogo/1_b_1.gif','img/adlogo/1_b_2.gif']
        },
        {
            "title":['男装','女装','内衣','珠宝','国际品牌','饰品'],
            "img_a":['img/adlogo/1_a_1.gif','img/adlogo/1_a_2.gif','img/adlogo/1_a_3.gif','img/adlogo/1_a_4.gif','img/adlogo/1_a_5.gif','img/adlogo/1_a_6.gif','img/adlogo/1_a_7.gif','img/adlogo/1_a_7.gif'],
            "img_b":['img/adlogo/1_b_1.gif','img/adlogo/1_b_2.gif']
        },
        {
            "title":['男装','女装','内衣','珠宝','国际品牌','饰品'],
            "img_a":['img/adlogo/1_a_1.gif','img/adlogo/1_a_2.gif','img/adlogo/1_a_3.gif','img/adlogo/1_a_4.gif','img/adlogo/1_a_5.gif','img/adlogo/1_a_6.gif','img/adlogo/1_a_7.gif','img/adlogo/1_a_7.gif'],
            "img_b":['img/adlogo/1_b_1.gif','img/adlogo/1_b_2.gif']
        },
        {
            "title":['男装','女装','内衣','珠宝','国际品牌','饰品'],
            "img_a":['img/adlogo/1_a_1.gif','img/adlogo/1_a_2.gif','img/adlogo/1_a_3.gif','img/adlogo/1_a_4.gif','img/adlogo/1_a_5.gif','img/adlogo/1_a_6.gif','img/adlogo/1_a_7.gif','img/adlogo/1_a_7.gif'],
            "img_b":['img/adlogo/1_b_1.gif','img/adlogo/1_b_2.gif']
        },
        {
            "title":['男装','女装','内衣','珠宝','国际品牌','饰品'],
            "img_a":['img/adlogo/1_a_1.gif','img/adlogo/1_a_2.gif','img/adlogo/1_a_3.gif','img/adlogo/1_a_4.gif','img/adlogo/1_a_5.gif','img/adlogo/1_a_6.gif','img/adlogo/1_a_7.gif','img/adlogo/1_a_7.gif'],
            "img_b":['img/adlogo/1_b_1.gif','img/adlogo/1_b_2.gif']
        },
        {
            "title":['男装','女装','内衣','珠宝','国际品牌','饰品'],
            "img_a":['img/adlogo/1_a_1.gif','img/adlogo/1_a_2.gif','img/adlogo/1_a_3.gif','img/adlogo/1_a_4.gif','img/adlogo/1_a_5.gif','img/adlogo/1_a_6.gif','img/adlogo/1_a_7.gif','img/adlogo/1_a_7.gif'],
            "img_b":['img/adlogo/1_b_1.gif','img/adlogo/1_b_2.gif']
        },
        {
            "title":['男装','女装','内衣','珠宝','国际品牌','饰品'],
            "img_a":['img/adlogo/1_a_1.gif','img/adlogo/1_a_2.gif','img/adlogo/1_a_3.gif','img/adlogo/1_a_4.gif','img/adlogo/1_a_5.gif','img/adlogo/1_a_6.gif','img/adlogo/1_a_7.gif','img/adlogo/1_a_7.gif'],
            "img_b":['img/adlogo/1_b_1.gif','img/adlogo/1_b_2.gif']
        },
        {
            "title":['男装','女装','内衣','珠宝','国际品牌','饰品'],
            "img_a":['img/adlogo/1_a_1.gif','img/adlogo/1_a_2.gif','img/adlogo/1_a_3.gif','img/adlogo/1_a_4.gif','img/adlogo/1_a_5.gif','img/adlogo/1_a_6.gif','img/adlogo/1_a_7.gif','img/adlogo/1_a_7.gif'],
            "img_b":['img/adlogo/1_b_1.gif','img/adlogo/1_b_2.gif']
        },
        {
            "title":['男装','女装','内衣','珠宝','国际品牌','饰品'],
            "img_a":['img/adlogo/1_a_1.gif','img/adlogo/1_a_2.gif','img/adlogo/1_a_3.gif','img/adlogo/1_a_4.gif','img/adlogo/1_a_5.gif','img/adlogo/1_a_6.gif','img/adlogo/1_a_7.gif','img/adlogo/1_a_7.gif'],
            "img_b":['img/adlogo/1_b_1.gif','img/adlogo/1_b_2.gif']
        },
        {
            "title":['男装','女装','内衣','珠宝','国际品牌','饰品'],
            "img_a":['img/adlogo/1_a_1.gif','img/adlogo/1_a_2.gif','img/adlogo/1_a_3.gif','img/adlogo/1_a_4.gif','img/adlogo/1_a_5.gif','img/adlogo/1_a_6.gif','img/adlogo/1_a_7.gif','img/adlogo/1_a_7.gif'],
            "img_b":['img/adlogo/1_b_1.gif','img/adlogo/1_b_2.gif']
        },
        {
            "title":['男装','女装','内衣','珠宝','国际品牌','饰品'],
            "img_a":['img/adlogo/1_a_1.gif','img/adlogo/1_a_2.gif','img/adlogo/1_a_3.gif','img/adlogo/1_a_4.gif','img/adlogo/1_a_5.gif','img/adlogo/1_a_6.gif','img/adlogo/1_a_7.gif','img/adlogo/1_a_7.gif'],
            "img_b":['img/adlogo/1_b_1.gif','img/adlogo/1_b_2.gif']
        },
        {
            "title":['男装','女装','内衣','珠宝','国际品牌','饰品'],
            "img_a":['img/adlogo/1_a_1.gif','img/adlogo/1_a_2.gif','img/adlogo/1_a_3.gif','img/adlogo/1_a_4.gif','img/adlogo/1_a_5.gif','img/adlogo/1_a_6.gif','img/adlogo/1_a_7.gif','img/adlogo/1_a_7.gif'],
            "img_b":['img/adlogo/1_b_1.gif','img/adlogo/1_b_2.gif']
        },
        {
            "title":['男装','女装','内衣','珠宝','国际品牌','饰品'],
            "img_a":['img/adlogo/1_a_1.gif','img/adlogo/1_a_2.gif','img/adlogo/1_a_3.gif','img/adlogo/1_a_4.gif','img/adlogo/1_a_5.gif','img/adlogo/1_a_6.gif','img/adlogo/1_a_7.gif','img/adlogo/1_a_7.gif'],
            "img_b":['img/adlogo/1_b_1.gif','img/adlogo/1_b_2.gif']
        }
    ];

    var arr2 =[
        [
            {"dt":'大家电',"dd":['平板电视','家用空调','家用中央空调','冰箱','洗衣机','家庭影院','DVD','迷你音响','冰柜/冰吧','酒柜','家电配件']},
            {"dt":'厨卫大电',"dd":['油烟机','燃气灶','烟灶套装','消毒柜','洗碗机','电热水器','燃气热水器','嵌入式厨电']},
            {"dt":'厨房小电',"dd":['电饭煲','微波炉','电烤箱','电磁炉','电压力锅','豆浆机','咖啡机','面包机','榨汁机','料理机','电饼档','养生壶/煎药壶','酸奶机','煮蛋器','电水壶/热水瓶','电炖锅','多用途锅','电烧烤炉','电热饭盒','其他厨房电器']},
            {"dt":'生活电器',"dd":['电风扇','冷风扇','吸尘器','净化器','扫地机器人','加湿器','挂烫机/熨斗','取暖电器','插座','电话机','净水器','饮水机','除湿器','干衣机','清洁机','收录/音机','其他生活电器','生活电器配件']},
            {"dt":'个护健康',"dd":['剃须刀','口腔护理','电吹风','美容器','卷/直发器','理发器','剃/脱毛器','足浴盆','健康秤/厨房秤','按摩器','按摩椅','血压计','血糖仪','体温计','计步器/脂肪检测仪','其他健康电器']},
            {"dt":'五金家族',"dd":['电动工具','手动工具','仪器仪表','浴霸/排气扇','灯具','LED灯','洁身器','水槽','龙头','沐浴花洒','厨卫五金','家具五金','门铃','电器开关','插座','电工电料','监控安防','电线线缆']}
        ],
        [
            {"dt":'理财',"dd":['京东小金库','票据理财','基金理财','定期理财','固收理财','妈妈理财','众投理财']},
            {"dt":'众筹',"dd":['智能硬件','流行文化','生活美学','公益','其他权益众筹']},
            {"dt":'东家',"dd":['私募股权']},
            {"dt":'白条',"dd":['京东白条','白条联名卡','京东钢镚','旅游白条','安居白条','校园白条','京东金采']},
            {"dt":'钱包',"dd":['京东钱包']},
            {"dt":'保险',"dd":['车险','健康险','意外险','旅行险']}
        ],
        [
            {"dt":'女装',"dd":['连衣裙','T恤','雪纺衫','衬衫','休闲裤','牛仔裤','针织衫','短外套','卫衣','小西装','风衣','毛呢大衣','半身裙','短裤','吊带/背心','打底衫','打底裤','症状裤','马甲','大码女装','中老年女装','真皮大衣','皮草','羊毛衫','羊绒衫','棉服','羽绒服','仿皮皮衣','加绒裤','婚纱','旗袍/唐装','礼服','设计师/潮牌']},
            {"dt":'男装',"dd":['衬衫','T恤','牛仔裤','休闲裤','卫衣','针织衫','西服','POLO衫','羽绒服','西服套装','真皮皮衣','夹克','风衣','卫裤/运动裤','短裤','仿皮皮衣','棉服','马甲/背心','毛呢大衣','羊毛衫','羊绒衫','大码男装','中老年男装','工装','设计师/潮牌','唐装/中山装','加绒裤']},
            {"dt":'内衣',"dd":['文胸','睡衣/家具服','男士内裤','女士内裤','塑身美体','文胸套装','情侣睡衣','吊带/背心','少女文胸','休闲棉袜','上午男袜','连裤袜/丝袜','美腿袜','打底裤袜','抹胸','内衣配件','大码内衣','打底衫','泳衣','秋衣秋裤','保暖内衣','情趣内衣']},
            {"dt":'配饰',"dd":['太阳镜','光学镜架/镜片','男士腰带/礼盒','防辐射眼镜','老花镜','女士丝巾/围巾/披肩','男士丝巾/围巾','棒球帽','遮阳帽','鸭舌帽','贝雷帽','礼帽','毛绒帽','防晒手套','真皮手套','围巾/手套/帽子套装','遮阳伞/雨伞','女士腰带/礼盒','口罩','假领','毛绒/布面料','领带/领结/领带夹','耳罩/耳包','袖扣','钥匙扣']},
            {"dt":'童装童鞋',"dd":['套装','上衣','运动鞋','裤子','内衣','皮鞋/帆布鞋','亲子装','羽绒服/棉服','运动服','靴子','演出服','裙子','功能鞋','凉鞋','配饰']}
        ],
        [
            {"dt":'女装',"dd":['连衣裙','T恤','雪纺衫','衬衫','休闲裤','牛仔裤','针织衫','短外套','卫衣','小西装','风衣','毛呢大衣','半身裙','短裤','吊带/背心','打底衫','打底裤','症状裤','马甲','大码女装','中老年女装','真皮大衣','皮草','羊毛衫','羊绒衫','棉服','羽绒服','仿皮皮衣','加绒裤','婚纱','旗袍/唐装','礼服','设计师/潮牌']},
            {"dt":'男装',"dd":['衬衫','T恤','牛仔裤','休闲裤','卫衣','针织衫','西服','POLO衫','羽绒服','西服套装','真皮皮衣','夹克','风衣','卫裤/运动裤','短裤','仿皮皮衣','棉服','马甲/背心','毛呢大衣','羊毛衫','羊绒衫','大码男装','中老年男装','工装','设计师/潮牌','唐装/中山装','加绒裤']},
            {"dt":'内衣',"dd":['文胸','睡衣/家具服','男士内裤','女士内裤','塑身美体','文胸套装','情侣睡衣','吊带/背心','少女文胸','休闲棉袜','上午男袜','连裤袜/丝袜','美腿袜','打底裤袜','抹胸','内衣配件','大码内衣','打底衫','泳衣','秋衣秋裤','保暖内衣','情趣内衣']},
            {"dt":'配饰',"dd":['太阳镜','光学镜架/镜片','男士腰带/礼盒','防辐射眼镜','老花镜','女士丝巾/围巾/披肩','男士丝巾/围巾','棒球帽','遮阳帽','鸭舌帽','贝雷帽','礼帽','毛绒帽','防晒手套','真皮手套','围巾/手套/帽子套装','遮阳伞/雨伞','女士腰带/礼盒','口罩','假领','毛绒/布面料','领带/领结/领带夹','耳罩/耳包','袖扣','钥匙扣']},
            {"dt":'童装童鞋',"dd":['套装','上衣','运动鞋','裤子','内衣','皮鞋/帆布鞋','亲子装','羽绒服/棉服','运动服','靴子','演出服','裙子','功能鞋','凉鞋','配饰']}
        ],[
            {"dt":'女装',"dd":['连衣裙','T恤','雪纺衫','衬衫','休闲裤','牛仔裤','针织衫','短外套','卫衣','小西装','风衣','毛呢大衣','半身裙','短裤','吊带/背心','打底衫','打底裤','症状裤','马甲','大码女装','中老年女装','真皮大衣','皮草','羊毛衫','羊绒衫','棉服','羽绒服','仿皮皮衣','加绒裤','婚纱','旗袍/唐装','礼服','设计师/潮牌']},
            {"dt":'男装',"dd":['衬衫','T恤','牛仔裤','休闲裤','卫衣','针织衫','西服','POLO衫','羽绒服','西服套装','真皮皮衣','夹克','风衣','卫裤/运动裤','短裤','仿皮皮衣','棉服','马甲/背心','毛呢大衣','羊毛衫','羊绒衫','大码男装','中老年男装','工装','设计师/潮牌','唐装/中山装','加绒裤']},
            {"dt":'内衣',"dd":['文胸','睡衣/家具服','男士内裤','女士内裤','塑身美体','文胸套装','情侣睡衣','吊带/背心','少女文胸','休闲棉袜','上午男袜','连裤袜/丝袜','美腿袜','打底裤袜','抹胸','内衣配件','大码内衣','打底衫','泳衣','秋衣秋裤','保暖内衣','情趣内衣']},
            {"dt":'配饰',"dd":['太阳镜','光学镜架/镜片','男士腰带/礼盒','防辐射眼镜','老花镜','女士丝巾/围巾/披肩','男士丝巾/围巾','棒球帽','遮阳帽','鸭舌帽','贝雷帽','礼帽','毛绒帽','防晒手套','真皮手套','围巾/手套/帽子套装','遮阳伞/雨伞','女士腰带/礼盒','口罩','假领','毛绒/布面料','领带/领结/领带夹','耳罩/耳包','袖扣','钥匙扣']},
            {"dt":'童装童鞋',"dd":['套装','上衣','运动鞋','裤子','内衣','皮鞋/帆布鞋','亲子装','羽绒服/棉服','运动服','靴子','演出服','裙子','功能鞋','凉鞋','配饰']}
        ],
        [
            {"dt":'女装',"dd":['连衣裙','T恤','雪纺衫','衬衫','休闲裤','牛仔裤','针织衫','短外套','卫衣','小西装','风衣','毛呢大衣','半身裙','短裤','吊带/背心','打底衫','打底裤','症状裤','马甲','大码女装','中老年女装','真皮大衣','皮草','羊毛衫','羊绒衫','棉服','羽绒服','仿皮皮衣','加绒裤','婚纱','旗袍/唐装','礼服','设计师/潮牌']},
            {"dt":'男装',"dd":['衬衫','T恤','牛仔裤','休闲裤','卫衣','针织衫','西服','POLO衫','羽绒服','西服套装','真皮皮衣','夹克','风衣','卫裤/运动裤','短裤','仿皮皮衣','棉服','马甲/背心','毛呢大衣','羊毛衫','羊绒衫','大码男装','中老年男装','工装','设计师/潮牌','唐装/中山装','加绒裤']},
            {"dt":'内衣',"dd":['文胸','睡衣/家具服','男士内裤','女士内裤','塑身美体','文胸套装','情侣睡衣','吊带/背心','少女文胸','休闲棉袜','上午男袜','连裤袜/丝袜','美腿袜','打底裤袜','抹胸','内衣配件','大码内衣','打底衫','泳衣','秋衣秋裤','保暖内衣','情趣内衣']},
            {"dt":'配饰',"dd":['太阳镜','光学镜架/镜片','男士腰带/礼盒','防辐射眼镜','老花镜','女士丝巾/围巾/披肩','男士丝巾/围巾','棒球帽','遮阳帽','鸭舌帽','贝雷帽','礼帽','毛绒帽','防晒手套','真皮手套','围巾/手套/帽子套装','遮阳伞/雨伞','女士腰带/礼盒','口罩','假领','毛绒/布面料','领带/领结/领带夹','耳罩/耳包','袖扣','钥匙扣']},
            {"dt":'童装童鞋',"dd":['套装','上衣','运动鞋','裤子','内衣','皮鞋/帆布鞋','亲子装','羽绒服/棉服','运动服','靴子','演出服','裙子','功能鞋','凉鞋','配饰']}
        ],
        [
            {"dt":'女装',"dd":['连衣裙','T恤','雪纺衫','衬衫','休闲裤','牛仔裤','针织衫','短外套','卫衣','小西装','风衣','毛呢大衣','半身裙','短裤','吊带/背心','打底衫','打底裤','症状裤','马甲','大码女装','中老年女装','真皮大衣','皮草','羊毛衫','羊绒衫','棉服','羽绒服','仿皮皮衣','加绒裤','婚纱','旗袍/唐装','礼服','设计师/潮牌']},
            {"dt":'男装',"dd":['衬衫','T恤','牛仔裤','休闲裤','卫衣','针织衫','西服','POLO衫','羽绒服','西服套装','真皮皮衣','夹克','风衣','卫裤/运动裤','短裤','仿皮皮衣','棉服','马甲/背心','毛呢大衣','羊毛衫','羊绒衫','大码男装','中老年男装','工装','设计师/潮牌','唐装/中山装','加绒裤']},
            {"dt":'内衣',"dd":['文胸','睡衣/家具服','男士内裤','女士内裤','塑身美体','文胸套装','情侣睡衣','吊带/背心','少女文胸','休闲棉袜','上午男袜','连裤袜/丝袜','美腿袜','打底裤袜','抹胸','内衣配件','大码内衣','打底衫','泳衣','秋衣秋裤','保暖内衣','情趣内衣']},
            {"dt":'配饰',"dd":['太阳镜','光学镜架/镜片','男士腰带/礼盒','防辐射眼镜','老花镜','女士丝巾/围巾/披肩','男士丝巾/围巾','棒球帽','遮阳帽','鸭舌帽','贝雷帽','礼帽','毛绒帽','防晒手套','真皮手套','围巾/手套/帽子套装','遮阳伞/雨伞','女士腰带/礼盒','口罩','假领','毛绒/布面料','领带/领结/领带夹','耳罩/耳包','袖扣','钥匙扣']},
            {"dt":'童装童鞋',"dd":['套装','上衣','运动鞋','裤子','内衣','皮鞋/帆布鞋','亲子装','羽绒服/棉服','运动服','靴子','演出服','裙子','功能鞋','凉鞋','配饰']}
        ],
        [
            {"dt":'女装',"dd":['连衣裙','T恤','雪纺衫','衬衫','休闲裤','牛仔裤','针织衫','短外套','卫衣','小西装','风衣','毛呢大衣','半身裙','短裤','吊带/背心','打底衫','打底裤','症状裤','马甲','大码女装','中老年女装','真皮大衣','皮草','羊毛衫','羊绒衫','棉服','羽绒服','仿皮皮衣','加绒裤','婚纱','旗袍/唐装','礼服','设计师/潮牌']},
            {"dt":'男装',"dd":['衬衫','T恤','牛仔裤','休闲裤','卫衣','针织衫','西服','POLO衫','羽绒服','西服套装','真皮皮衣','夹克','风衣','卫裤/运动裤','短裤','仿皮皮衣','棉服','马甲/背心','毛呢大衣','羊毛衫','羊绒衫','大码男装','中老年男装','工装','设计师/潮牌','唐装/中山装','加绒裤']},
            {"dt":'内衣',"dd":['文胸','睡衣/家具服','男士内裤','女士内裤','塑身美体','文胸套装','情侣睡衣','吊带/背心','少女文胸','休闲棉袜','上午男袜','连裤袜/丝袜','美腿袜','打底裤袜','抹胸','内衣配件','大码内衣','打底衫','泳衣','秋衣秋裤','保暖内衣','情趣内衣']},
            {"dt":'配饰',"dd":['太阳镜','光学镜架/镜片','男士腰带/礼盒','防辐射眼镜','老花镜','女士丝巾/围巾/披肩','男士丝巾/围巾','棒球帽','遮阳帽','鸭舌帽','贝雷帽','礼帽','毛绒帽','防晒手套','真皮手套','围巾/手套/帽子套装','遮阳伞/雨伞','女士腰带/礼盒','口罩','假领','毛绒/布面料','领带/领结/领带夹','耳罩/耳包','袖扣','钥匙扣']},
            {"dt":'童装童鞋',"dd":['套装','上衣','运动鞋','裤子','内衣','皮鞋/帆布鞋','亲子装','羽绒服/棉服','运动服','靴子','演出服','裙子','功能鞋','凉鞋','配饰']}
        ],
        [
            {"dt":'女装',"dd":['连衣裙','T恤','雪纺衫','衬衫','休闲裤','牛仔裤','针织衫','短外套','卫衣','小西装','风衣','毛呢大衣','半身裙','短裤','吊带/背心','打底衫','打底裤','症状裤','马甲','大码女装','中老年女装','真皮大衣','皮草','羊毛衫','羊绒衫','棉服','羽绒服','仿皮皮衣','加绒裤','婚纱','旗袍/唐装','礼服','设计师/潮牌']},
            {"dt":'男装',"dd":['衬衫','T恤','牛仔裤','休闲裤','卫衣','针织衫','西服','POLO衫','羽绒服','西服套装','真皮皮衣','夹克','风衣','卫裤/运动裤','短裤','仿皮皮衣','棉服','马甲/背心','毛呢大衣','羊毛衫','羊绒衫','大码男装','中老年男装','工装','设计师/潮牌','唐装/中山装','加绒裤']},
            {"dt":'内衣',"dd":['文胸','睡衣/家具服','男士内裤','女士内裤','塑身美体','文胸套装','情侣睡衣','吊带/背心','少女文胸','休闲棉袜','上午男袜','连裤袜/丝袜','美腿袜','打底裤袜','抹胸','内衣配件','大码内衣','打底衫','泳衣','秋衣秋裤','保暖内衣','情趣内衣']},
            {"dt":'配饰',"dd":['太阳镜','光学镜架/镜片','男士腰带/礼盒','防辐射眼镜','老花镜','女士丝巾/围巾/披肩','男士丝巾/围巾','棒球帽','遮阳帽','鸭舌帽','贝雷帽','礼帽','毛绒帽','防晒手套','真皮手套','围巾/手套/帽子套装','遮阳伞/雨伞','女士腰带/礼盒','口罩','假领','毛绒/布面料','领带/领结/领带夹','耳罩/耳包','袖扣','钥匙扣']},
            {"dt":'童装童鞋',"dd":['套装','上衣','运动鞋','裤子','内衣','皮鞋/帆布鞋','亲子装','羽绒服/棉服','运动服','靴子','演出服','裙子','功能鞋','凉鞋','配饰']}
        ],[
            {"dt":'女装',"dd":['连衣裙','T恤','雪纺衫','衬衫','休闲裤','牛仔裤','针织衫','短外套','卫衣','小西装','风衣','毛呢大衣','半身裙','短裤','吊带/背心','打底衫','打底裤','症状裤','马甲','大码女装','中老年女装','真皮大衣','皮草','羊毛衫','羊绒衫','棉服','羽绒服','仿皮皮衣','加绒裤','婚纱','旗袍/唐装','礼服','设计师/潮牌']},
            {"dt":'男装',"dd":['衬衫','T恤','牛仔裤','休闲裤','卫衣','针织衫','西服','POLO衫','羽绒服','西服套装','真皮皮衣','夹克','风衣','卫裤/运动裤','短裤','仿皮皮衣','棉服','马甲/背心','毛呢大衣','羊毛衫','羊绒衫','大码男装','中老年男装','工装','设计师/潮牌','唐装/中山装','加绒裤']},
            {"dt":'内衣',"dd":['文胸','睡衣/家具服','男士内裤','女士内裤','塑身美体','文胸套装','情侣睡衣','吊带/背心','少女文胸','休闲棉袜','上午男袜','连裤袜/丝袜','美腿袜','打底裤袜','抹胸','内衣配件','大码内衣','打底衫','泳衣','秋衣秋裤','保暖内衣','情趣内衣']},
            {"dt":'配饰',"dd":['太阳镜','光学镜架/镜片','男士腰带/礼盒','防辐射眼镜','老花镜','女士丝巾/围巾/披肩','男士丝巾/围巾','棒球帽','遮阳帽','鸭舌帽','贝雷帽','礼帽','毛绒帽','防晒手套','真皮手套','围巾/手套/帽子套装','遮阳伞/雨伞','女士腰带/礼盒','口罩','假领','毛绒/布面料','领带/领结/领带夹','耳罩/耳包','袖扣','钥匙扣']},
            {"dt":'童装童鞋',"dd":['套装','上衣','运动鞋','裤子','内衣','皮鞋/帆布鞋','亲子装','羽绒服/棉服','运动服','靴子','演出服','裙子','功能鞋','凉鞋','配饰']}
        ],
        [
            {"dt":'女装',"dd":['连衣裙','T恤','雪纺衫','衬衫','休闲裤','牛仔裤','针织衫','短外套','卫衣','小西装','风衣','毛呢大衣','半身裙','短裤','吊带/背心','打底衫','打底裤','症状裤','马甲','大码女装','中老年女装','真皮大衣','皮草','羊毛衫','羊绒衫','棉服','羽绒服','仿皮皮衣','加绒裤','婚纱','旗袍/唐装','礼服','设计师/潮牌']},
            {"dt":'男装',"dd":['衬衫','T恤','牛仔裤','休闲裤','卫衣','针织衫','西服','POLO衫','羽绒服','西服套装','真皮皮衣','夹克','风衣','卫裤/运动裤','短裤','仿皮皮衣','棉服','马甲/背心','毛呢大衣','羊毛衫','羊绒衫','大码男装','中老年男装','工装','设计师/潮牌','唐装/中山装','加绒裤']},
            {"dt":'内衣',"dd":['文胸','睡衣/家具服','男士内裤','女士内裤','塑身美体','文胸套装','情侣睡衣','吊带/背心','少女文胸','休闲棉袜','上午男袜','连裤袜/丝袜','美腿袜','打底裤袜','抹胸','内衣配件','大码内衣','打底衫','泳衣','秋衣秋裤','保暖内衣','情趣内衣']},
            {"dt":'配饰',"dd":['太阳镜','光学镜架/镜片','男士腰带/礼盒','防辐射眼镜','老花镜','女士丝巾/围巾/披肩','男士丝巾/围巾','棒球帽','遮阳帽','鸭舌帽','贝雷帽','礼帽','毛绒帽','防晒手套','真皮手套','围巾/手套/帽子套装','遮阳伞/雨伞','女士腰带/礼盒','口罩','假领','毛绒/布面料','领带/领结/领带夹','耳罩/耳包','袖扣','钥匙扣']},
            {"dt":'童装童鞋',"dd":['套装','上衣','运动鞋','裤子','内衣','皮鞋/帆布鞋','亲子装','羽绒服/棉服','运动服','靴子','演出服','裙子','功能鞋','凉鞋','配饰']}
        ],
        [
            {"dt":'女装',"dd":['连衣裙','T恤','雪纺衫','衬衫','休闲裤','牛仔裤','针织衫','短外套','卫衣','小西装','风衣','毛呢大衣','半身裙','短裤','吊带/背心','打底衫','打底裤','症状裤','马甲','大码女装','中老年女装','真皮大衣','皮草','羊毛衫','羊绒衫','棉服','羽绒服','仿皮皮衣','加绒裤','婚纱','旗袍/唐装','礼服','设计师/潮牌']},
            {"dt":'男装',"dd":['衬衫','T恤','牛仔裤','休闲裤','卫衣','针织衫','西服','POLO衫','羽绒服','西服套装','真皮皮衣','夹克','风衣','卫裤/运动裤','短裤','仿皮皮衣','棉服','马甲/背心','毛呢大衣','羊毛衫','羊绒衫','大码男装','中老年男装','工装','设计师/潮牌','唐装/中山装','加绒裤']},
            {"dt":'内衣',"dd":['文胸','睡衣/家具服','男士内裤','女士内裤','塑身美体','文胸套装','情侣睡衣','吊带/背心','少女文胸','休闲棉袜','上午男袜','连裤袜/丝袜','美腿袜','打底裤袜','抹胸','内衣配件','大码内衣','打底衫','泳衣','秋衣秋裤','保暖内衣','情趣内衣']},
            {"dt":'配饰',"dd":['太阳镜','光学镜架/镜片','男士腰带/礼盒','防辐射眼镜','老花镜','女士丝巾/围巾/披肩','男士丝巾/围巾','棒球帽','遮阳帽','鸭舌帽','贝雷帽','礼帽','毛绒帽','防晒手套','真皮手套','围巾/手套/帽子套装','遮阳伞/雨伞','女士腰带/礼盒','口罩','假领','毛绒/布面料','领带/领结/领带夹','耳罩/耳包','袖扣','钥匙扣']},
            {"dt":'童装童鞋',"dd":['套装','上衣','运动鞋','裤子','内衣','皮鞋/帆布鞋','亲子装','羽绒服/棉服','运动服','靴子','演出服','裙子','功能鞋','凉鞋','配饰']}
        ],
        [
            {"dt":'女装',"dd":['连衣裙','T恤','雪纺衫','衬衫','休闲裤','牛仔裤','针织衫','短外套','卫衣','小西装','风衣','毛呢大衣','半身裙','短裤','吊带/背心','打底衫','打底裤','症状裤','马甲','大码女装','中老年女装','真皮大衣','皮草','羊毛衫','羊绒衫','棉服','羽绒服','仿皮皮衣','加绒裤','婚纱','旗袍/唐装','礼服','设计师/潮牌']},
            {"dt":'男装',"dd":['衬衫','T恤','牛仔裤','休闲裤','卫衣','针织衫','西服','POLO衫','羽绒服','西服套装','真皮皮衣','夹克','风衣','卫裤/运动裤','短裤','仿皮皮衣','棉服','马甲/背心','毛呢大衣','羊毛衫','羊绒衫','大码男装','中老年男装','工装','设计师/潮牌','唐装/中山装','加绒裤']},
            {"dt":'内衣',"dd":['文胸','睡衣/家具服','男士内裤','女士内裤','塑身美体','文胸套装','情侣睡衣','吊带/背心','少女文胸','休闲棉袜','上午男袜','连裤袜/丝袜','美腿袜','打底裤袜','抹胸','内衣配件','大码内衣','打底衫','泳衣','秋衣秋裤','保暖内衣','情趣内衣']},
            {"dt":'配饰',"dd":['太阳镜','光学镜架/镜片','男士腰带/礼盒','防辐射眼镜','老花镜','女士丝巾/围巾/披肩','男士丝巾/围巾','棒球帽','遮阳帽','鸭舌帽','贝雷帽','礼帽','毛绒帽','防晒手套','真皮手套','围巾/手套/帽子套装','遮阳伞/雨伞','女士腰带/礼盒','口罩','假领','毛绒/布面料','领带/领结/领带夹','耳罩/耳包','袖扣','钥匙扣']},
            {"dt":'童装童鞋',"dd":['套装','上衣','运动鞋','裤子','内衣','皮鞋/帆布鞋','亲子装','羽绒服/棉服','运动服','靴子','演出服','裙子','功能鞋','凉鞋','配饰']}
        ],
        [
            {"dt":'女装',"dd":['连衣裙','T恤','雪纺衫','衬衫','休闲裤','牛仔裤','针织衫','短外套','卫衣','小西装','风衣','毛呢大衣','半身裙','短裤','吊带/背心','打底衫','打底裤','症状裤','马甲','大码女装','中老年女装','真皮大衣','皮草','羊毛衫','羊绒衫','棉服','羽绒服','仿皮皮衣','加绒裤','婚纱','旗袍/唐装','礼服','设计师/潮牌']},
            {"dt":'男装',"dd":['衬衫','T恤','牛仔裤','休闲裤','卫衣','针织衫','西服','POLO衫','羽绒服','西服套装','真皮皮衣','夹克','风衣','卫裤/运动裤','短裤','仿皮皮衣','棉服','马甲/背心','毛呢大衣','羊毛衫','羊绒衫','大码男装','中老年男装','工装','设计师/潮牌','唐装/中山装','加绒裤']},
            {"dt":'内衣',"dd":['文胸','睡衣/家具服','男士内裤','女士内裤','塑身美体','文胸套装','情侣睡衣','吊带/背心','少女文胸','休闲棉袜','上午男袜','连裤袜/丝袜','美腿袜','打底裤袜','抹胸','内衣配件','大码内衣','打底衫','泳衣','秋衣秋裤','保暖内衣','情趣内衣']},
            {"dt":'配饰',"dd":['太阳镜','光学镜架/镜片','男士腰带/礼盒','防辐射眼镜','老花镜','女士丝巾/围巾/披肩','男士丝巾/围巾','棒球帽','遮阳帽','鸭舌帽','贝雷帽','礼帽','毛绒帽','防晒手套','真皮手套','围巾/手套/帽子套装','遮阳伞/雨伞','女士腰带/礼盒','口罩','假领','毛绒/布面料','领带/领结/领带夹','耳罩/耳包','袖扣','钥匙扣']},
            {"dt":'童装童鞋',"dd":['套装','上衣','运动鞋','裤子','内衣','皮鞋/帆布鞋','亲子装','羽绒服/棉服','运动服','靴子','演出服','裙子','功能鞋','凉鞋','配饰']}
        ],[
            {"dt":'女装',"dd":['连衣裙','T恤','雪纺衫','衬衫','休闲裤','牛仔裤','针织衫','短外套','卫衣','小西装','风衣','毛呢大衣','半身裙','短裤','吊带/背心','打底衫','打底裤','症状裤','马甲','大码女装','中老年女装','真皮大衣','皮草','羊毛衫','羊绒衫','棉服','羽绒服','仿皮皮衣','加绒裤','婚纱','旗袍/唐装','礼服','设计师/潮牌']},
            {"dt":'男装',"dd":['衬衫','T恤','牛仔裤','休闲裤','卫衣','针织衫','西服','POLO衫','羽绒服','西服套装','真皮皮衣','夹克','风衣','卫裤/运动裤','短裤','仿皮皮衣','棉服','马甲/背心','毛呢大衣','羊毛衫','羊绒衫','大码男装','中老年男装','工装','设计师/潮牌','唐装/中山装','加绒裤']},
            {"dt":'内衣',"dd":['文胸','睡衣/家具服','男士内裤','女士内裤','塑身美体','文胸套装','情侣睡衣','吊带/背心','少女文胸','休闲棉袜','上午男袜','连裤袜/丝袜','美腿袜','打底裤袜','抹胸','内衣配件','大码内衣','打底衫','泳衣','秋衣秋裤','保暖内衣','情趣内衣']},
            {"dt":'配饰',"dd":['太阳镜','光学镜架/镜片','男士腰带/礼盒','防辐射眼镜','老花镜','女士丝巾/围巾/披肩','男士丝巾/围巾','棒球帽','遮阳帽','鸭舌帽','贝雷帽','礼帽','毛绒帽','防晒手套','真皮手套','围巾/手套/帽子套装','遮阳伞/雨伞','女士腰带/礼盒','口罩','假领','毛绒/布面料','领带/领结/领带夹','耳罩/耳包','袖扣','钥匙扣']},
            {"dt":'童装童鞋',"dd":['套装','上衣','运动鞋','裤子','内衣','皮鞋/帆布鞋','亲子装','羽绒服/棉服','运动服','靴子','演出服','裙子','功能鞋','凉鞋','配饰']}
        ]

    ];


    for(var i= 0; i<arr1[index].title.length; i++){
        var $title = $('<li><a href="#"><span>' + arr1[index].title[i] + '</span><i>></i></a></li>');
        $('.nav_2_1').append($title)
    }
    for(var i= 0; i<arr1[index].img_a.length; i++){
        var $img_a = $('<li><a href="#"><img src="' + arr1[index].img_a[i] + '"></a></li>');
        $('.nav_2_3').append($img_a)
    }
    for(var i= 0; i<arr1[index].img_b.length; i++){
        var $img_b = $('<li><a href="#"><img src="' + arr1[index].img_b[i] + '"></a></li>');
        $('.nav_2_4').append($img_b)
    }
    for(var i= 0; i<arr2[index].length; i++){
        var $dl = $('<dl class="clear"></dl>');
        $('.nav_2_2').append($dl);
        var $dt = $('<dt><span>' + arr2[index][i].dt + '</span><i>></i></dt>');
        $dl.append($dt);
        var $dd = $('<dd></dd>');
        $dl.append($dd);
        for(var j= 0; j<arr2[index][i].dd.length; j++){
            var $div = $('<div><a href="#">' + arr2[index][i].dd[j] + '</a></div>');
            $dd.append($div);
        }
    }
}

function removePopupData(){
    $('.nav_2_1').empty();
    $('.nav_2_2').empty();
    $('.nav_2_3').empty();
    $('.nav_2_4').empty();
}